"Operation succeeded"  = "Toimenpide onnistui";
"ID is invalid"  = "Tunnus on virheellinen";
"Write attempted on stale version of object"  = "On yritetty kirjoittaa kohteen kelpaamattomalle versiolle";
"No space available for write operation"  = "Kirjoitustoimenpiteelle ei tilaa";
"Permission denied"  = "Ei oikeutta";
"No such directory"  = "Ei kyseistä hakemistoa";
"No such property"  = "Ei kyseistä ominaisuutta";
"No such name"  = "Ei kyseistä nimeä";
"Cannot delete name object with children"  = "Nimikohdetta, jolla jälkeläisiä, ei voida tuhota";
"Object is not child of parent: cannot destroy"  = "Kohde ei ole jälkeläinen: ei voida tuhota";
"Serialization error"  = "Sarjallistamisvirhe";
"Hit network root domain"  = "Verkon juuritason domain tullut vastaan";
"No response from remote parent"  = "Ei vastausta palvelimelta";
"No writes allowed: all objects are read-only"  = "Kirjoittaminen ei ole sallittua: kaikki kohteet vain lukukohteita";
"Remote system error" = "Etäjärjestelmävirhe";
"Can't regenerate: already in use"  = "Ei voida luoda uudelleen: on jo käytössä";
"Operation makes no sense on clone"  = "Operaatiota ei kannata tehdä kloonille";
"Can't find address of server"  = "Palvelimen osoitetta ei löydy";
"Duplicate domain tag: can't serve it"  = "Samanniminen domaintagi: sitä ei voida palvella";
"No such tag"  = "Ei kyseistä tagia";
"Authentication error" = "Autentikointivirhe";
"No such user" = "Ei kyseistä käyttäjää";
"Master server is busy" = "Pääpalvelin varattu";
"Invalid domain" = "Virheellinen domain";
"Invalid operation on master" = "Päätason käyttövirhe";
"Communication failure" = "Yhteysvirhe";
"(unknown error)" = "(tuntematon virhe)";
